bitmorse/LilyGo_Txx/T10_V20_1C8_ESP-IDF/sdkconfig.defaults
# Board-specific defaults for the LilyGO TTGO T10 V2.0 (ESP32).
# These are applied automatically on the first build; edit with `make menuconfig`.

CONFIG_IDF_TARGET="esp32"

# 4 MB flash, DIO mode (matches the factory Arduino settings for this board)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Custom partition table with a 3 MB app partition (LVGL firmware exceeds the
# default 1 MB single-app layout).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The T10/TS boards do NOT have usable PSRAM -> leave SPIRAM disabled (default).

# A little extra stack for app_main (display + wifi work happens here).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Serial console @ 115200 (what `make monitor` expects).
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# --- LVGL 9 configuration (Kconfig-driven; no manual lv_conf.h) -------------
CONFIG_LV_CONF_SKIP=n
CONFIG_LV_COLOR_DEPTH_16=y
# ST7735 wants big-endian RGB565; we byte-swap in the flush callback instead of
# here, so leave LV_COLOR_16_SWAP off.
# Only the widgets this app actually uses.
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_CHART=y
CONFIG_LV_USE_QRCODE=y
# Don't compile LVGL's bundled examples/demos into the firmware.
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
# Heap for LVGL objects (DRAM). Kept small since BLE+WiFi+LVGL share RAM.
CONFIG_LV_USE_STDLIB_MALLOC_BUILTIN=y
CONFIG_LV_MEM_SIZE_KILOBYTES=32
# We drive lv_tick via esp_timer (lv_tick_set_cb), so no built-in tick.
CONFIG_LV_USE_LOG=n

# --- Bluetooth (BLE) for WiFi provisioning ---------------------------------
# NimBLE host (lighter than Bluedroid) + BLE-only controller.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
# One BLE connection is enough for provisioning (saves RAM).
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# --- RAM/IRAM reclamation (BLE+WiFi+LVGL together overflow internal RAM) ----
# Build for size; frees flash, IRAM and DRAM.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# Move WiFi hot paths out of IRAM into flash (small throughput cost, big IRAM win).
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
# Move rarely-used FreeRTOS functions to flash.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
# Trim WiFi static RX buffers a little (DRAM).
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16

# HTTPS: use the built-in CA certificate bundle (for the ZRH traffic fetch).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# --- Vibration logging (SD + high-rate accel FIFO) --------------------------
# 1 kHz FreeRTOS tick so the sampler task can poll the 512-byte IMU FIFO every
# ~2 ms (at 100 Hz the 10 ms min delay risks FIFO overflow at 4 kHz / 24 KB/s).
CONFIG_FREERTOS_HZ=1000
# FATFS long filenames so "vibNNNN.mcap" (4-char extension) is allowed.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64

# --- File-sync HTTP throughput ---------------------------------------------
# The default 5760-byte TCP send/receive buffers stall the ESP32 after ~5.7 KB
# waiting for the peer's delayed ACK -> ~6 KB/s. Larger buffers keep much more
# data in flight. These are per-connection (allocated from heap at connect), so
# they cost nothing at boot and File Sync mode has ample free heap.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=24576
CONFIG_LWIP_TCP_WND_DEFAULT=24576
CONFIG_LWIP_TCP_RECVMBOX_SIZE=16
